Revit 2027 API
FilterElementIdRule.RuleValue Property
 The user-supplied value against which values from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RuleValue { get; set; }
Public Property RuleValue As ElementId
	Get
	Set
public:
property ElementId^ RuleValue {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RuleValue : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FilterElementIdRule Class
Autodesk.Revit.DB Namespace